## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.nco_app will be updated in-place
  ~ resource "helm_release" "nco_app" {
      ~ id                         = "nco-app" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.0.1" -> (known after apply)
          ~ chart          = "app" -> (known after apply)
          ~ first_deployed = 1752968506 -> (known after apply)
          ~ last_deployed  = 1752968506 -> (known after apply)
          ~ name           = "nco-app" -> (known after apply)
          ~ namespace      = "nco" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get the application URL by running these commands:
                  https://nco.prudnitskiy.pro/
            EOT -> (known after apply)
          ~ revision       = 1 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - image   = {
                      - tag = "0.0.1"
                    }
                  - ingress = {
                      - enabled = true
                      - hosts   = [
                          - {
                              - host  = "nco.prudnitskiy.pro"
                              - paths = [
                                  - {
                                      - path     = "/"
                                      - pathType = "Prefix"
                                    },
                                ]
                            },
                        ]
                      - tls     = [
                          - {
                              - hosts = [
                                  - "nco.prudnitskiy.pro",
                                ]
                            },
                        ]
                    }
                }
            ) -> (known after apply)
          ~ version        = "0.1.0" -> (known after apply)
        } -> (known after apply)
        name                       = "nco-app"
      ~ values                     = [
          ~ <<-EOT
                "image":
              -   "tag": "0.0.1"
              +   "tag": ""
                "ingress":
                  "enabled": true
                  "hosts":
                  - "host": "nco.prudnitskiy.pro"
                    "paths":
                    - "path": "/"
                      "pathType": "Prefix"
                  "tls":
                  - "hosts":
                    - "nco.prudnitskiy.pro"
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>